{"author":"思晴","date":"2017-03-01T00:00:00Z","html":"\u003ch2 id=\"1-白-这样的东西是不存在的\"\u003e1.“‘白’这样的东西是不存在的。”\u003c/h2\u003e\n\n\u003cp\u003e\u003cdiv class=\"image-package\"\u003e\u003cimg src=\"/设计/img/art-1851483_1280.jpg\" alt=\"art-1851483_1280\"/\u003e\u003c/div\u003e\u003c/p\u003e\n\n\u003cp\u003e漂白的骨头让我们与死亡相连，但奶和蛋的白，又对我们述说着生命，衣服的白，又让我们感觉到了温暖与舒适。母乳的哺育对所有的哺乳动物来说都是重要行为，但无论动物还是人类，所有的乳汁都是白色的。大多数蛋也都是白色的，无论下这些蛋的鸟是什么颜色，白鸟下白蛋，蓝鸟也是，黑鸟也是，蛇也是，甚至鳄鱼也是。真正的生命居于白之中。蛋壳就像是构成这个世界与另一个世界边界的膜。当其打开，出来的就不在是白的，而是该种动物之本色。\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003e世间本没有“白”，而我们经常感觉到了“它”的存在。在这个现实世界中，白总是被污染的、不纯的。它只是一道痕迹，一道其指向本源的标志而已,我们可能感觉到了白，但那只是一种幻觉。\u003cstrong\u003e“白””包含了所有颜色，又褪去了所有颜色，是负熵的极限，是生命的起始，是信息的“边缘”。\u003c/strong\u003e当我们获得了与“白”的这种联系，我们的世界发出的光就更亮了，投出的影也就更深了。\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003e白的纯洁是短暂的，因为他很容易被玷污，也正是人们意识`到了美的转瞬即逝，才异常珍惜，这也就是人的本性吧，即得不到的才是最美的，是不是有点贱啊，嘿嘿嘿。\u003c/p\u003e\n\n\u003ch2 id=\"2-清理思绪-还原事物的本质\"\u003e2.清理思绪，还原事物的本质。\u003c/h2\u003e\n\n\u003cp\u003e\u003cdiv class=\"image-package\"\u003e\u003cimg src=\"/设计/img/broom-919674_640.jpg\" alt=\"broom-919674_640\"/\u003e\u003c/div\u003e\u003c/p\u003e\n\n\u003cp\u003e一座花园的美不在于一位有才华的设计师所创造出的那些精彩特征，实际上，它的美是通过不断的清理过程揭开的。优雅之美并非短期努力所能成就，其建立只能通过漫长的清理和打磨过程。\u003c/p\u003e\n\n\u003cp\u003e自然一直在自我转化，其内在力量远比我们想象的强大。岩石、苔藓和落叶经过一段漫长的时间化为泥土，树皮的颜色褪去，而后又重生一新，池塘里的水则是一种净蓝。\u003c/p\u003e\n\n\u003cp\u003e人们一方面试图通过有意识地运用创造力自然之美竞争。这种意识体现在各个公共场合的花园中，花园中的鹅卵石要求不断打理，如遭忽视，白色很快被热成土地的颜色，花园的白色地面很快就会被自然落叶和泥土所覆盖。为保持其白，鹅卵石之间自然累积的泥土必须清理掉，这是一件需要大量时间和力气的工作。花园的维护靠的是人类与自然的衰败过程无休止的斗争，保住人类创造出自认为美的东西，努力保持其事物（人类创造出的）本来面貌。\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003e但作为“自然”角度，它做的事亦是如此，清理掉不必要的东西，保持事物的本质。\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003e纸质出版的一个特点就是油墨，一旦印上去了就再也擦不掉了，这种情况就容许了大跃进完善信息的原则，换句话说，由于其不可逆性意味着，我们必须不断挑战自己，克服自己在上面的失误。因此，当我们在上面得到了某种东西，我们的情感就会不断被打动。就在书不断地被修改打磨，错误点不断被清理掉的过程中，我们遇到了“白”，尝到了清理思绪的美。\u003c/p\u003e\n\n\u003ch2 id=\"3-思与空\"\u003e3.思与空\u003c/h2\u003e\n\n\u003cp\u003e\u003cdiv class=\"image-package\"\u003e\u003cimg src=\"/设计/img/cat-2021682_640.jpg\" alt=\"cat-2021682_640\"/\u003e\u003c/div\u003e\u003c/p\u003e\n\n\u003cp\u003e空其实提供了一个让我们想象力自由发挥的空间，大大丰富了我们的想象力。陕西岐山当地（不是现在一大碗的这种哈）有一种臊子面，客人几乎一口一碗，客人吃完，服务员再上一份，如客人又吃完，服务员马上又上一份。由于上的量小的一口就能吞下，上与吃的循环就要无数次重复，客人很难控制它吃的份量，因为看着空碗越摞越高，感觉很有成就，所以就不停的吃，上涨的碗垛就是他们成就的证明。\u003c/p\u003e\n\n\u003cp\u003e思的行为很像吃臊子面的颠倒，客人看着摞起的空碗，以其“思”而非“面”填入其中。他这样做也是遵循一定节奏的，先是一个想法填入一个碗，然后一瞬间，又一个，然后又一个……如此这般，就像一个条件反射，“想法”在他眼前堆积起来，空面碗的例子反映了思的总体机制。简言之，我们的大脑自动讲“答案”插入小的设置空间，以此方式，\u003cstrong\u003e空带着我们思的过程前行\u003c/strong\u003e。\u003c/p\u003e\n","location":"设计/不存在的“白”","picture":"/设计/img/art-1851483_1280.jpg","tags":["设计"],"title":"不存在的“白”\n"}